In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
dict1= { 
    "name": ['Avani', 'Bhumi', 'Siya', 'Khushi'],
    "marks": [ 50, 100, 80, 90],
    "city": ['Mumbai', 'Pune', 'Bangalore', 'Delhi']
}

In [4]:
df=pd.DataFrame(dict1)

In [5]:
df

     name  marks       city
0   Avani     50     Mumbai
1   Bhumi    100       Pune
2    Siya     80  Bangalore
3  Khushi     90      Delhi

In [6]:
df.to_csv('sisters.csv')

In [7]:
df.head(2) #displays first two rows

    name  marks    city
0  Avani     50  Mumbai
1  Bhumi    100    Pune

In [8]:
df.tail(3) #dsiplays last 3 rows

     name  marks       city
1   Bhumi    100       Pune
2    Siya     80  Bangalore
3  Khushi     90      Delhi

In [9]:
df.to_csv('without index sisters', index=False)

In [10]:
df.describe() #gives all the averages, count, mean, std dev, min, max etc of numerical values

            marks
count    4.000000
mean    80.000000
std     21.602469
min     50.000000
25%     72.500000
50%     85.000000
75%     92.500000
max    100.000000

In [11]:
avani= ('sisters.csv')

In [13]:
avani['marks'][0]=99

TypeError: string indices must be integers, not 'str'